---
kind: type
id: T:Autodesk.Revit.DB.FilterCategoryRule
source: html/7df5b10b-c423-b5c8-6492-1274d7a447d9.htm
---
# Autodesk.Revit.DB.FilterCategoryRule

A filter rule that matches elements of a set of categories.

## Syntax (C#)
```csharp
public class FilterCategoryRule : FilterRule
```